In [1]:
import pandas as pd
import numpy as np

In [8]:
labels = ["W","X","Y","Z"]
dict_1 = {"W":100,"X":200,"Y":300,"Z":400}
sample_list = [10,20,30,40]
arr1 = np.array([1,2,3,4])

In [3]:
pd.Series(labels,index=arr1)

1    W
2    X
3    Y
4    Z
dtype: object

In [4]:
pd.Series(labels)

0    W
1    X
2    Y
3    Z
dtype: object

In [6]:
pd.Series(data=labels)

0    W
1    X
2    Y
3    Z
dtype: object

In [7]:
pd.Series(arr1,labels)

W    1
X    2
Y    3
Z    4
dtype: int32

In [9]:
pd.Series(dict_1)

W    100
X    200
Y    300
Z    400
dtype: int64

# Pandas Data Frame and Indexing

In [10]:
sports1= pd.Series([1,2,3,4], ["Cricket","Football","Baksetball", "Golf"])

In [11]:
sports1

Cricket       1
Football      2
Baksetball    3
Golf          4
dtype: int64

In [13]:
sports1["Football"]

2

In [19]:
sports1[["Cricket","Football"]] ## doubts

Cricket     1
Football    2
dtype: int64

In [24]:
sports2=pd.Series([5,6,7,8,9],["Cricket","Football","Baseball","Basketball","fvdg"])

In [25]:
sports1+sports2

Baksetball    NaN
Baseball      NaN
Basketball    NaN
Cricket       6.0
Football      8.0
Golf          NaN
fvdg          NaN
dtype: float64

In [27]:
df = pd.DataFrame(np.random.rand(8,5),"A B C D E F G H".split(),columns="Score1 Score2 Score3 Score4 Score5".split())

In [28]:
df

     Score1    Score2    Score3    Score4    Score5
A  0.440163  0.747724  0.382340  0.198463  0.351607
B  0.082509  0.989064  0.323457  0.192155  0.334591
C  0.602951  0.738913  0.634285  0.034257  0.826895
D  0.079318  0.943746  0.454151  0.748524  0.836170
E  0.304534  0.907524  0.432746  0.761407  0.879160
F  0.154073  0.465010  0.213441  0.624176  0.579440
G  0.563330  0.806389  0.963660  0.978599  0.352337
H  0.391459  0.230348  0.989627  0.660382  0.348352

In [29]:
df["Score6"]= df["Score3"] + df["Score4"]

In [30]:
df

     Score1    Score2    Score3    Score4    Score5    Score6
A  0.440163  0.747724  0.382340  0.198463  0.351607  0.580803
B  0.082509  0.989064  0.323457  0.192155  0.334591  0.515612
C  0.602951  0.738913  0.634285  0.034257  0.826895  0.668542
D  0.079318  0.943746  0.454151  0.748524  0.836170  1.202675
E  0.304534  0.907524  0.432746  0.761407  0.879160  1.194153
F  0.154073  0.465010  0.213441  0.624176  0.579440  0.837617
G  0.563330  0.806389  0.963660  0.978599  0.352337  1.942258
H  0.391459  0.230348  0.989627  0.660382  0.348352  1.650009

In [31]:
df["Score1"]

A    0.440163
B    0.082509
C    0.602951
D    0.079318
E    0.304534
F    0.154073
G    0.563330
H    0.391459
Name: Score1, dtype: float64

In [32]:
df[["Score1","Score2"]]

     Score1    Score2
A  0.440163  0.747724
B  0.082509  0.989064
C  0.602951  0.738913
D  0.079318  0.943746
E  0.304534  0.907524
F  0.154073  0.465010
G  0.563330  0.806389
H  0.391459  0.230348

In [36]:
df_new= df.drop("Score6", axis=1)

In [38]:
df_new["Score5"]

A    0.351607
B    0.334591
C    0.826895
D    0.836170
E    0.879160
F    0.579440
G    0.352337
H    0.348352
Name: Score5, dtype: float64

In [39]:
df_new.drop("H")

     Score1    Score2    Score3    Score4    Score5
A  0.440163  0.747724  0.382340  0.198463  0.351607
B  0.082509  0.989064  0.323457  0.192155  0.334591
C  0.602951  0.738913  0.634285  0.034257  0.826895
D  0.079318  0.943746  0.454151  0.748524  0.836170
E  0.304534  0.907524  0.432746  0.761407  0.879160
F  0.154073  0.465010  0.213441  0.624176  0.579440
G  0.563330  0.806389  0.963660  0.978599  0.352337

In [40]:
df2={"ID":[1,2,3,4,5],"Name":["Rubal","Sahil","Piyush","Ravi","Lavish"],"Profit":[200,300,100,234,120]}
df3= pd.DataFrame(df2)

In [41]:
df3

   ID    Name  Profit
0   1   Rubal     200
1   2   Sahil     300
2   3  Piyush     100
3   4    Ravi     234
4   5  Lavish     120

In [42]:
df3.drop(0)

   ID    Name  Profit
1   2   Sahil     300
2   3  Piyush     100
3   4    Ravi     234
4   5  Lavish     120

# How to import datasets using Pandas

In [2]:
import pandas as pd

In [3]:
df = pd.read_csv("I:/Data Science/Eduonix/Instructor - Prema Latha/Datasets-main/CardioGoodFitness-1.csv")

In [47]:
df.shape

(180, 9)

In [51]:
df.head()

  Product  Age  Gender  Education MaritalStatus  Usage  Fitness  Income  Miles
0   TM195   18    Male         14        Single      3        4   29562    112
1   TM195   19    Male         15        Single      2        3   31836     75
2   TM195   19  Female         14     Partnered      4        3   30699     66
3   TM195   19    Male         12        Single      3        3   32973     85
4   TM195   20    Male         13     Partnered      4        2   35247     47

In [52]:
df.head(10)

  Product  Age  Gender  Education MaritalStatus  Usage  Fitness  Income  Miles
0   TM195   18    Male         14        Single      3        4   29562    112
1   TM195   19    Male         15        Single      2        3   31836     75
2   TM195   19  Female         14     Partnered      4        3   30699     66
3   TM195   19    Male         12        Single      3        3   32973     85
4   TM195   20    Male         13     Partnered      4        2   35247     47
5   TM195   20  Female         14     Partnered      3        3   32973     66
6   TM195   21  Female         14     Partnered      3        3   35247     75
7   TM195   21    Male         13        Single      3        3   32973     85
8   TM195   21    Male         15        Single      5        4   35247    141
9   TM195   21  Female         15     Partnered      2        3   37521     85

In [61]:
df.sample(10)

,Product,Age,Gender,Education,MaritalStatus,Usage,Fitness,Income,Miles
96,TM498,24,Female,16,Single,3,3,50028,106
27,TM195,25,Female,14,Partnered,3,3,48891,75
56,TM195,31,Female,14,Single,2,2,45480,47
108,TM498,26,Female,16,Partnered,4,3,45480,85
102,TM498,25,Female,14,Single,2,3,43206,64
44,TM195,28,Female,14,Partnered,2,3,46617,56
159,TM798,27,Male,16,Partnered,4,5,83416,160
74,TM195,41,Male,16,Partnered,4,3,54576,103
148,TM798,24,Female,16,Single,5,5,52291,200
62,TM195,34,Female,16,Single,2,2,52302,66

In [62]:
df.shape ## number of rows and number of columns

(180, 9)

In [63]:
df.dtypes

Product          object
Age               int64
Gender           object
Education         int64
MaritalStatus    object
Usage             int64
Fitness           int64
Income            int64
Miles             int64
dtype: object

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 180 entries, 0 to 179
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Product        180 non-null    object
 1   Age            180 non-null    int64
 2   Gender         180 non-null    object
 3   Education      180 non-null    int64
 4   MaritalStatus  180 non-null    object
 5   Usage          180 non-null    int64
 6   Fitness        180 non-null    int64
 7   Income         180 non-null    int64
 8   Miles          180 non-null    int64
dtypes: int64(6), object(3)
memory usage: 12.8+ KB

In [8]:
df.isnull().sum()

Product          0
Age              0
Gender           0
Education        0
MaritalStatus    0
Usage            0
Fitness          0
Income           0
Miles            0
dtype: int64

In [9]:
df.describe() ## only for numerical columns

,Age,Education,Usage,Fitness,Income,Miles
count,180.000000,180.000000,180.000000,180.000000,180.000000,180.000000
mean,28.788889,15.572222,3.455556,3.311111,53719.577778,103.194444
std,6.943498,1.617055,1.084797,0.958869,16506.684226,51.863605
min,18.000000,12.000000,2.000000,1.000000,29562.000000,21.000000
25%,24.000000,14.000000,3.000000,3.000000,44058.750000,66.000000
50%,26.000000,16.000000,3.000000,3.000000,50596.500000,94.000000
75%,33.000000,16.000000,4.000000,4.000000,58668.000000,114.750000
max,50.000000,21.000000,7.000000,5.000000,104581.000000,360.000000

In [11]:
df.describe(include="all") ## only for numerical columns

,Product,Age,Gender,Education,MaritalStatus,Usage,Fitness,Income,Miles
count,180,180.000000,180,180.000000,180,180.000000,180.000000,180.000000,180.000000
unique,3,NaN,2,NaN,2,NaN,NaN,NaN,NaN
top,TM195,NaN,Male,NaN,Partnered,NaN,NaN,NaN,NaN
freq,80,NaN,104,NaN,107,NaN,NaN,NaN,NaN
mean,NaN,28.788889,NaN,15.572222,NaN,3.455556,3.311111,53719.577778,103.194444
std,NaN,6.943498,NaN,1.617055,NaN,1.084797,0.958869,16506.684226,51.863605
min,NaN,18.000000,NaN,12.000000,NaN,2.000000,1.000000,29562.000000,21.000000
25%,NaN,24.000000,NaN,14.000000,NaN,3.000000,3.000000,44058.750000,66.000000
50%,NaN,26.000000,NaN,16.000000,NaN,3.000000,3.000000,50596.500000,94.000000
75%,NaN,33.000000,NaN,16.000000,NaN,4.000000,4.000000,58668.000000,114.750000
max,NaN,50.000000,NaN,21.000000,NaN,7.000000,5.000000,104581.000000,360.000000

In [15]:
airline= pd.read_csv("I:/Data Science/Eduonix/Instructor - Prema Latha/Datasets-main/airline-passenger-traffic.csv", header=None, names=["Year","Traffic"])

In [16]:
airline.head()

      Year  Traffic
0  1949-01    112.0
1  1949-02    118.0
2  1949-03    132.0
3  1949-04    129.0
4  1949-05    121.0

In [17]:
airline.shape

(144, 2)

In [20]:
airline.sample(10)

        Year  Traffic
142  1960-11    390.0
59   1953-12    201.0
4    1949-05    121.0
62   1954-03    235.0
97   1957-02    301.0
85   1956-02    277.0
55   1953-08    272.0
133  1960-02    391.0
1    1949-02    118.0
30   1951-07      NaN

In [22]:
airline.dtypes

Year        object
Traffic    float64
dtype: object

In [25]:
airline.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 144 entries, 0 to 143
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Year     144 non-null    object
 1   Traffic  140 non-null    float64
dtypes: float64(1), object(1)
memory usage: 2.4+ KB

In [28]:
airline.describe(include="all")

           Year     Traffic
count       144  140.000000
unique      144         NaN
top     1949-01         NaN
freq          1         NaN
mean        NaN  280.735714
std         NaN  120.593235
min         NaN  104.000000
25%         NaN  180.000000
50%         NaN  268.000000
75%         NaN  360.500000
max         NaN  622.000000

In [29]:
airline.isnull().sum()

Year       0
Traffic    4
dtype: int64